# -*- coding: UTF-8 -*-
#  高级特性
# 掌握了Python的数据类型、语句和函数，基本上就可以编写出很多有用的程序了。
#
# 比如构造一个1, 3, 5, 7, ..., 99的列表，可以通过循环实现：
L = []
n = 1
while n <= 99:
    L.append(n)
    n = n + 2

print(
    L)  # =>[1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99]
# 取list的前一半的元素，也可以通过循环实现。
#
# 但是在Python中，代码不是越多越好，而是越少越好。代码不是越复杂越好，而是越简单越好。
#
# 基于这一思想，我们来介绍Python中非常有用的高级特性，1行代码能实现的功能，决不写5行代码。请始终牢记，代码越少，开发效率越高。

# 切片
# 取一个list或tuple的部分元素是非常常见的操作。比如，一个list如下：
L = ["zky1", 'zky2', 'zky3', 'zky4', 'zky5']

print(L)  # => ['zky1', 'zky2', 'zky3', 'zky4', 'zky5']

# 取前3个元素，应该怎么做？
#
# 笨办法：
print([L[0], L[1], L[2]])

# 之所以是笨办法是因为扩展一下，取前N个元素就没辙了。
#
# 取前N个元素，也就是索引为0-(N-1)的元素，可以用循环：
r = []
n = 3
for i in range(n):
    r.append(L[i])
print(r)  # =>['zky1', 'zky2', 'zky3']

# 对这种经常取指定索引范围的操作，用循环十分繁琐，因此，Python提供了切片（Slice）操作符，能大大简化这种操作。
#
# 对应上面的问题，取前3个元素，用一行代码就可以完成切片：

print(L[0:3])  # =>['zky1', 'zky2', 'zky3']

# L[0:3]表示，从索引0开始取，直到索引3为止，但不包括索引3。即索引0，1，2，正好是3个元素。
#
# 如果第一个索引是0，还可以省略：

print(L[:3])  # =>['zky1', 'zky2', 'zky3']

# 也可以从索引1开始，取出2个元素出来：
print(L[1:3])  # => ['zky2', 'zky3']
# 类似的，既然Python支持L[-1]取倒数第一个元素，那么它同样支持倒数切片，试试：
print(L[-2:])  # =>['zky4', 'zky5']

print(L[-2:-1])  # =>['zky4']

# 记住倒数第一个元素的索引是-1。
#
# 切片操作十分有用。我们先创建一个0-99的数列：
L = list(range(100))
print(
    L)  # => [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]
# 可以通过切片轻松取出某一段数列。比如前10个数：
print(L[:10])  # => [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# 后10个数：
print(L[-10:])  # => [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]
# 前11-20个数：
print(L[10:20])  # => [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
# 前10个数，每两个取一个：
print(L[:10:2])  # =>[0, 2, 4, 6, 8]
# 所有数，每5个取一个：
print(L[::5])  # =>[0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95]

# 甚至什么都不写，只写[:]就可以原样复制一个list：
print(L[
      :])  # => [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

# tuple也是一种list，唯一区别是tuple不可变。因此，tuple也可以用切片操作，只是操作的结果仍是tuple：
print((0, 1, 2, 3, 4, 5, 6)[:3])  # => (0, 1, 2)

# 字符串'xxx'也可以看成是一种list，每个元素就是一个字符。因此，字符串也可以用切片操作，只是操作结果仍是字符串：
print("ABCDEFG"[1:4])  # => BCD

print("ABCDEFGHIGKLMN"[::2])  # =>ACEGIKM
print("12345"[:-1])  # =>1234


# 在很多编程语言中，针对字符串提供了很多各种截取函数（例如，substring），其实目的就是对字符串切片。Python没有针对字符串的截取函数，只需要切片一个操作就可以完成，非常简单。


# 练习
# 利用切片操作，实现一个trim()函数，去除字符串首尾的空格，注意不要调用str的strip()方法：
def trim(s):
    temp = ''
    if s[0] == ' ':
        temp = s[1:]
    elif s[-1] == ' ':
        temp = s[:-1]
    elif s[0] == ' ' and s[-1] == ' ':
        temp = s[1:-1]
    else:
        temp = s
    return temp


print('*' + trim(" 1234") + "*")
